print("Hello, World! 😊")
print("*" * 10)


student_count = 10000  # 类型是int
rating = 4.99  # 类型是float
is_published = True  # 类型是bool

print(student_count)
print(rating)
print(is_published)


# 变量命名规则
# 1. 变量名只能包含字母、数字和下划线
# 2. 变量名不能以数字开头
# 3. 变量名不能是关键字
# 4. 变量名最好有意义
# 5. 变量名最好使用小写字母

# 变量命名习惯
# 1. 变量名使用小写字母
# 2. 变量名使用下划线连接
# 3. 变量名最好有意义
# 4. 变量名最好使用有意义的单词
# 5. 变量名最好使用有意义的单词

# 数据类型
# 1. 整数
# 2. 浮点数
# 3. 字符串
# 4. 布尔值
# 5. 空值

# 1. 整数
count = 10

# 2. 浮点数
rating = 4.99

# 3. 字符串
name = "John"

# 4. 布尔值
is_published = True

# 5. 空值
price = None

# # 类型转换
# x = input("x: ")
# y = int(x) + 1
# print(y)

# 中文编码
print("你好，世界！")

# 注释形式
# 单行注释
"""
多行注释
多行注释
"""

print('hello, world!')

print("It's a beautiful day")  # 不需要转义
print('It\'s a beautiful day')  # 需要转义
'''
这是多行字符串
使用三重双引号
'''


"""
这是多行字符串
使用三重单引号
"""

# 字符串拼接
name = "John"
age = 25
message = "My name is " + name + " and I am " + str(age) + " years old."
print(message)